Repository: KryptonGao/StudyPulse
Catalog: StudyPulse/Localizable.xcstrings
Source language: en
Languages: ja, ko, zh_hans, zh_hant

# 压力失忆型
source: Pressure performance drop
ja: プレッシャー低下型
ko: 압박 성과 저하형
zh_hans: 压力失忆型
zh_hant: 壓力失憶型

# 去配置
source: Configure
ja: 設定へ
ko: 설정하기
zh_hans: 去配置
zh_hant: 去設定

# 双指滑动/缩放
source: Pinch to pan/zoom
ja: 2本指で移動/ズーム
ko: 두 손가락으로 이동/확대
zh_hans: 双指滑动/缩放
zh_hant: 雙指滑動/縮放

# 取消
source: Cancel
ja: キャンセル
ko: 취소
zh_hans: 取消
zh_hant: 取消

# 可选：指定章节或知识点
source: Optional: chapter or topic
ja: 任意：章・学習項目
ko: 선택: 단원 또는 주제
zh_hans: 可选：指定章节或知识点
zh_hant: 可選：指定章節或知識點

# 响应
source: Response
ja: レスポンス
ko: 응답
zh_hans: 响应
zh_hant: 回應

# 基于本次 AI 总分预测继续提问
source: Continue asking about this AI total score prediction
ja: この AI 合計点予測についてさらに質問する
ko: 이 AI 총점 예측에 대해 계속 질문하기
zh_hans: 基于本次 AI 总分预测继续提问
zh_hant: 基於本次 AI 總分預測繼續提問

# 基于本次 AI 预测继续提问
source: Continue asking about this AI prediction
ja: この AI 予測についてさらに質問する
ko: 이 AI 예측에 대해 계속 질문하기
zh_hans: 基于本次 AI 预测继续提问
zh_hant: 基於本次 AI 預測繼續提問

# 填空题
source: Fill in the blank
ja: 穴埋め問題
ko: 빈칸 채우기
zh_hans: 填空题
zh_hant: 填空題

# 复习
source: Review
ja: 復習
ko: 복습
zh_hans: 复习
zh_hant: 複習

# 复习过少,未纳入计算
source: Too few reviews, not used in calculation
ja: 復習回数が少ないため計算に含めません
ko: 복습 횟수 부족, 계산에 포함되지 않음
zh_hans: 复习过少,未纳入计算
zh_hant: 複習次數過少,未納入計算

# 学生
source: Student
ja: 学生
ko: 학생
zh_hans: 学生
zh_hant: 學生

# 它观察你如何分配时间、跳题和修改答案，不判断你的性格。
source: It observes how you allocate time, skip questions, and change answers. It does not judge your personality.
ja: 時間配分、問題のスキップ、解答変更を観察します。性格判断ではありません。
ko: 시간 배분, 문제 건너뛰기, 답 변경을 관찰하며 성격을 판단하지 않습니다.
zh_hans: 它观察你如何分配时间、跳题和修改答案，不判断你的性格。
zh_hant: 它觀察你如何分配時間、跳題和修改答案，不判斷你的性格。

# 已创建错题 "%@",并加入 SRS 复习队列。
source: Created mistake note "%@" and added it to the SRS review queue.
ja: ミスノート「%@」を作成し、SRS 復習キューに追加しました。
ko: 오답 노트「%@」를 생성하고 SRS 복습 큐에 추가했습니다.
zh_hans: 已创建错题「%@」,并加入 SRS 复习队列。
zh_hant: 已建立錯題「%@」,並加入 SRS 複習佇列。

# 已取消
source: Cancelled
ja: キャンセルしました
ko: 취소됨
zh_hans: 已取消
zh_hant: 已取消

# 开始前需要配置 BYOK 大模型。
source: Configure a BYOK language model before starting.
ja: 開始前にBYOK言語モデルを設定してください。
ko: 시작 전에 BYOK 언어 모델을 설정해야 합니다.
zh_hans: 开始前需要配置 BYOK 大模型。
zh_hant: 開始前需要設定 BYOK 大模型。

# 开始第一次模拟
source: Start your first simulation
ja: 最初の模擬試験を開始
ko: 첫 모의시험 시작
zh_hans: 开始第一次模拟
zh_hant: 開始第一次模擬

# 开始限时模拟
source: Start timed simulation
ja: 制限時間つき模擬試験を開始
ko: 시간 제한 모의시험 시작
zh_hans: 开始限时模拟
zh_hant: 開始限時模擬

# 当此处有内容时,所有 AI 功能都会**完全使用此 prompt**,跳过默认 + Appendix。 仅 DEBUG 模式可见,便于排查 prompt 行为。
source: When set, every AI feature uses ONLY this prompt, skipping the default + Appendix. Visible only in DEBUG mode; meant for prompt debugging.
ja: ここに内容がある場合、すべての AI 機能はこのプロンプトのみを使用し、デフォルト + Appendix をスキップします。 DEBUG モードでのみ表示され、プロンプトの動作確認用です。
ko: 여기에 내용이 있으면 모든 AI 기능이 이 프롬프트만 사용하고 기본 + Appendix를 건너뜁니다. DEBUG 모드에서만 표시되며 프롬프트 디버깅용입니다.
zh_hans: 当此处有内容时,所有 AI 功能都会**完全使用此 prompt**,跳过默认 + Appendix。 仅 DEBUG 模式可见,便于排查 prompt 行为。
zh_hant: 當此處有內容時,所有 AI 功能都會**完全使用此 prompt**,跳過預設 + Appendix。 僅 DEBUG 模式可見,便於排查 prompt 行為。

# 录音
source: Recording
ja: 録音
ko: 녹음
zh_hans: 录音
zh_hant: 錄音

# 思考时间
source: Thinking time
ja: 思考時間
ko: 사고 시간
zh_hans: 思考时间
zh_hant: 思考時間

# 成绩
source: Grades
ja: 成績
ko: 성적
zh_hans: 成绩
zh_hant: 成績

# 我最近的数学成绩怎么样?
source: How are my recent math grades?
ja: 最近の数学の成績はどう?
ko: 최근 수학 성적은 어떤가요?
zh_hans: 我最近的数学成绩怎么样?
zh_hant: 我最近的數學成績怎麼樣?

# 我已知晓且了解删除所有数据的后果，我愿意承担丢失所有数据的后果
source: I understand the consequences of deleting all data and I am willing to take responsibility for losing all data
ja: すべてのデータを削除する結果を理解し、すべてのデータを失う責任を負うことに同意します
ko: 모든 데이터를 삭제하는 결과를 이해했으며 모든 데이터를 잃을 책임에 동의합니다
zh_hans: 我已知晓且了解删除所有数据的后果，我愿意承担丢失所有数据的后果
zh_hant: 我已知曉且了解刪除所有資料的後果，我願意承擔遺失所有資料的後果

# 提交
source: Submit
ja: 提出
ko: 제출
zh_hans: 提交
zh_hant: 提交

# 提交模拟试卷？
source: Submit this simulation?
ja: 模擬試験を提出しますか？
ko: 모의시험을 제출할까요?
zh_hans: 提交模拟试卷？
zh_hant: 提交模擬試卷？

# 提示
source: Notice
ja: お知らせ
ko: 알림
zh_hans: 提示
zh_hant: 提示

# 改答案型
source: Answer changing
ja: 解答変更型
ko: 답 변경형
zh_hans: 改答案型
zh_hant: 改答案型

# 时间
source: Time
ja: 時刻
ko: 시간
zh_hans: 时间
zh_hant: 時間

# 暂无 LLM 调用记录
source: No LLM calls yet
ja: LLM 呼び出し履歴がありません
ko: LLM 호출 기록이 없습니다
zh_hans: 暂无 LLM 调用记录
zh_hant: 暫無 LLM 呼叫記錄

# 未作答题目将按空白答案参与阅卷。
source: Unanswered questions will be graded as blank.
ja: 未回答の問題は空欄として採点されます。
ko: 미응답 문제는 빈 답으로 채점됩니다.
zh_hans: 未作答题目将按空白答案参与阅卷。
zh_hant: 未作答題目將以空白答案參與閱卷。

# 未配置 AI · 前往设置
source: AI not configured — Open Settings
ja: AI 未設定 · 設定を開く
ko: AI 미설정 · 설정 열기
zh_hans: 未配置 AI · 前往设置
zh_hant: 未設定 AI · 前往設定

# 未配置 LLM,无法使用 AI 预测
source: LLM not configured, AI prediction unavailable
ja: LLM が未設定のため AI 予測は使用できません
ko: LLM이 설정되지 않아 AI 예측을 사용할 수 없습니다
zh_hans: 未配置 LLM,无法使用 AI 预测
zh_hant: 未設定 LLM,無法使用 AI 預測

# 未配置大模型
source: LLM not configured
ja: LLM が未設定です
ko: LLM 미설정
zh_hans: 未配置大模型
zh_hant: 未設定大模型

# 本周学习时间够不够?
source: Did I study enough this week?
ja: 今週の学習時間は足りてる?
ko: 이번 주 학습 시간은 충분한가요?
zh_hans: 本周学习时间够不够?
zh_hant: 本週學習時間夠不夠?

# 本次未完成的模拟会标记为已退出，不会用于稳定模式判断。
source: This unfinished simulation will be marked as exited and excluded from recurring-mode analysis.
ja: 未完了として記録され、継続パターンの判定には使用されません。
ko: 미완료로 기록되며 반복 모드 판단에는 사용되지 않습니다.
zh_hans: 本次未完成的模拟会标记为已退出，不会用于稳定模式判断。
zh_hant: 本次未完成的模擬會標記為已退出，不會用於穩定模式判斷。

# 本次考场模式
source: Current exam mode
ja: 今回の試験モード
ko: 이번 시험 모드
zh_hans: 本次考场模式
zh_hant: 本次考場模式

# 查看数据快照
source: View data snapshot
ja: データスナップショットを表示
ko: 데이터 스냅샷 보기
zh_hans: 查看数据快照
zh_hant: 查看資料快照

# 概览
source: Overview
ja: 概要
ko: 개요
zh_hans: 概览
zh_hant: 概覽

# 正在为您量身定制变式训练...
source: Customizing tailored exercises...
ja: カスタマイズされた類題演習を編成中...
ko: 맞춤형 유사 문제 훈련을 구성하는 중...
zh_hans: 正在为您量身定制变式训练…
zh_hant: 正在為您量身定制變式訓練…

# 正在分析您的薄弱考点...
source: Analyzing your weak test points...
ja: あなたの苦手な出題ポイントを分析中...
ko: 취약한 출제 포인트를 분석하는 중...
zh_hans: 正在分析您的薄弱考点…
zh_hant: 正在分析您的薄弱考點…

# 正在分析答题轨迹…
source: Analyzing your answer path…
ja: 解答の流れを分析中…
ko: 답안 흐름 분석 중…
zh_hans: 正在分析答题轨迹…
zh_hant: 正在分析答題軌跡…

# 正在判断需要哪些数据…
source: Deciding which data is needed…
ja: 必要なデータを見極め中…
ko: 필요한 데이터 판단 중…
zh_hans: 正在判断需要哪些数据…
zh_hant: 正在判斷需要哪些資料…

# 正在提取错题中的核心概念...
source: Extracting core concepts from mistake notes...
ja: 間違えた問題から核心コンセプトを抽出中...
ko: 오답에서 핵심 개념을 추출하는 중...
zh_hans: 正在提取错题中的核心概念…
zh_hant: 正在提取錯題中的核心概念…

# 正在撰写深度的正确解题思路...
source: Writing in-depth correct solving approaches...
ja: 詳細な正しい解法のプロセスを執筆中...
ko: 상세하고 올바른 풀이 방식을 정리하는 중...
zh_hans: 正在撰写深度的正确解题思路…
zh_hant: 正在撰寫深度的正確解題思路…

# 正在梳理知识脉络与关联...
source: Combing knowledge paths and relationships...
ja: 知識のつながりと関連性を整理中...
ko: 지식 구조와 연관성을 정리하는 중...
zh_hans: 正在梳理知识脉络与关联…
zh_hant: 正在梳理知識脈絡與關聯…

# 正在沉淀易错防坑指南...
source: Compiling mistake-prevention guidelines...
ja: よくあるミスの防止ガイドを整理中...
ko: 실수 방지 가이드를 정리하는 중...
zh_hans: 正在沉淀易错防坑指南…
zh_hant: 正在沉澱易錯防坑指南…

# 正在生成回答…
source: Generating answer…
ja: 回答を生成中…
ko: 응답 생성 중…
zh_hans: 正在生成回答…
zh_hant: 正在生成回答…

# 正在生成模拟试卷…
source: Generating your simulation…
ja: 模擬問題を生成中…
ko: 모의시험 생성 중…
zh_hans: 正在生成模拟试卷…
zh_hant: 正在生成模擬試卷…

# 正在绘制个性化知识拓扑结构...
source: Drawing personalized knowledge topology...
ja: 個別化された知識トポロジーを作成中...
ko: 개인 맞춤형 지식 구조도를 그리는 중...
zh_hans: 正在绘制个性化知识拓扑结构…
zh_hant: 正在繪製個性化知識拓撲結構…

# 正在解构错题的考查要点...
source: Deconstructing key points of the mistake...
ja: 問題の出題ポイントを分解中...
ko: 오답의 핵심 평가 요소를 분석하는 중...
zh_hans: 正在解构错题的考查要点…
zh_hant: 正在解構錯題的考查要點…

# 正在诊断您的思维误区...
source: Diagnosing cognitive misconceptions...
ja: 思考の誤りや誤解を診断中...
ko: 오답을 유발한 사고 오류를 진단하는 중...
zh_hans: 正在诊断您的思维误区…
zh_hant: 正在診斷您的思維誤區…

# 每 10 次复习 → %@ %@
source: Every 10 reviews → %@ %@
ja: 10 回の復習ごと → %@ %@
ko: 복습 10회당 → %@ %@
zh_hans: 每 10 次复习 → %@ %@

# 深入探讨
source: Discuss Further
ja: さらに議論
ko: 심층 토론
zh_hans: 深入探讨
zh_hant: 深入探討

# 深入讨论
source: Discuss Further
ja: 詳しく議論
ko: 심층 논의
zh_hans: 深入讨论
zh_hant: 深入討論

# 温和
source: Gentle
ja: 穏やか
ko: 온화
zh_hans: 温和
zh_hant: 溫和

# 点击右上角「Copy JSON」可把整条调用打包为 JSON 复制到剪贴板,便于上报 / 比对。
source: Tap Copy JSON (top-right) to dump the whole call as JSON for bug reports / comparison.
ja: 右上の「Copy JSON」で呼び出し全体を JSON としてコピーし、レポート / 比較に使えます。
ko: 우측 상단 「Copy JSON」으로 호출 전체를 JSON 으로 복사해 리포트 / 비교에 활용하세요.
zh_hans: 点击右上角「Copy JSON」可把整条调用打包为 JSON 复制到剪贴板,便于上报 / 比对。
zh_hant: 點擊右上角「Copy JSON」可把整個呼叫打包為 JSON 複製到剪貼簿,便於回報 / 比對。

# 现在应该复习什么?
source: What should I review right now?
ja: 今何を復習すべき?
ko: 지금 무엇을 복습해야 하나요?
zh_hans: 现在应该复习什么?
zh_hant: 現在應該複習什麼?

# 立刻分析
source: Analyze Now
ja: 今すぐ分析
ko: 지금 분석
zh_hans: 立刻分析
zh_hant: 立刻分析

# 第 %d 题
source: Question %d
ja: 第%d問
ko: %d번 문제
zh_hans: 第 %d 题
zh_hant: 第 %d 題

# 等待分析
source: Awaiting analysis
ja: 分析待ち
ko: 분석 대기
zh_hans: 等待分析
zh_hant: 等待分析

# 网络或模型响应异常，请稍后重试。
source: The network or model response failed. Try again later.
ja: ネットワークまたはモデル応答に問題があります。後でもう一度お試しください。
ko: 네트워크 또는 모델 응답에 문제가 있습니다. 나중에 다시 시도하세요.
zh_hans: 网络或模型响应异常，请稍后重试。
zh_hant: 網路或模型回應異常，請稍後重試。

# 置信度 %d%%
source: Confidence %d%%
ja: 信頼度 %d%%
ko: 신뢰도 %d%%
zh_hans: 置信度 %d%%
zh_hant: 信心度 %d%%

# 老师会先质疑你的第一步。请不要只报答案，要解释为什么。
source: The teacher will question your first step. Explain why, not just the answer.
ja: 先生が最初の一歩を問いかけます。答えだけでなく理由を説明してください。
ko: 선생님이 첫 단계를 질문합니다. 답만 말하지 말고 이유를 설명하세요.
zh_hans: 老师会先质疑你的第一步。请不要只报答案，要解释为什么。
zh_hant: 老師會先質疑你的第一步。請不要只報答案，要解釋為什麼。

# 考场人格模拟器
source: Exam Role Simulator
ja: 試験ロール・シミュレーター
ko: 시험 역할 시뮬레이터
zh_hans: 考场人格模拟器
zh_hant: 考場角色模擬器

# 草稿区
source: Draft Area
ja: 下書きエリア
ko: 초안 영역
zh_hans: 草稿区
zh_hant: 草稿區

# 行为证据
source: Behavior evidence
ja: 行動の根拠
ko: 행동 근거
zh_hans: 行为证据
zh_hant: 行為證據

# 触发任意 AI 功能后,这里会显示 URL / Prompt / 思考时间 / 响应。
source: After any AI feature runs, this shows URL / Prompt / thinking time / response.
ja: AI 機能を実行すると、ここに URL / Prompt / 思考時間 / レスポンスが表示されます。
ko: AI 기능을 실행하면 여기에 URL / Prompt / 사고 시간 / 응답이 표시됩니다.
zh_hans: 触发任意 AI 功能后,这里会显示 URL / Prompt / 思考时间 / 响应。
zh_hant: 觸發任意 AI 功能後,這裡會顯示 URL / Prompt / 思考時間 / 回應。

# 让大模型基于历史成绩、错题状态和默认预测,给出第二意见。
source: Ask the LLM to give a second opinion based on your history, mistakes, and the default prediction.
ja: 履歴・間違い状況・デフォルト予測をもとに、LLM に第二の意見を出してもらいます。
ko: 기록, 오답 현황, 기본 예측을 바탕으로 LLM이 두 번째 의견을 제시합니다.
zh_hans: 让大模型基于历史成绩、错题状态和默认预测,给出第二意见。
zh_hant: 讓大模型基於歷史成績、錯題狀態和預設預測,給出第二意見。

# 让大模型基于各科默认预测,给出总分第二意见。
source: Ask the LLM to give a second-opinion total based on the per-subject default predictions.
ja: 各科のデフォルト予測をもとに、LLM に合計点の第二意見を出してもらいます。
ko: 각 과목의 기본 예측을 바탕으로 LLM이 총점의 두 번째 의견을 제시합니다.
zh_hans: 让大模型基于各科默认预测,给出总分第二意见。
zh_hant: 讓大模型基於各科預設預測,給出總分第二意見。

# 让大模型预测
source: Ask LLM to Predict
ja: LLM に予測させる
ko: LLM에 예측시키기
zh_hans: 让大模型预测
zh_hant: 讓大模型預測

# 识别压力下的答题决策模式，而不是定义你的性格。
source: Recognize how you make exam decisions under pressure—not define your personality.
ja: プレッシャー下での解答判断を分析します。性格を決めつけるものではありません。
ko: 압박 상황의 답안 의사결정 패턴을 분석하며 성격을 규정하지 않습니다.
zh_hans: 识别压力下的答题决策模式，而不是定义你的性格。
zh_hant: 辨識壓力下的答題決策模式，而不是定義你的性格。

# 请先在设置中配置大模型
source: Please configure the LLM in Settings first
ja: 先に設定で LLM を設定してください
ko: 먼저 설정에서 LLM 을 설정하세요
zh_hans: 请先在设置中配置大模型
zh_hant: 請先在設定中設定大模型

# 请先配置 LLM，才能开始考场模拟。
source: Configure an LLM before starting an exam simulation.
ja: 模擬試験を開始する前にLLMを設定してください。
ko: 시험 시뮬레이션을 시작하기 전에 LLM을 설정하세요.
zh_hans: 请先配置 LLM，才能开始考场模拟。
zh_hant: 請先設定 LLM，才能開始考場模擬。

# 请求
source: Request
ja: リクエスト
ko: 요청
zh_hans: 请求
zh_hant: 請求

# 调用方
source: Caller
ja: 呼び出し元
ko: 호출자
zh_hans: 调用方
zh_hant: 呼叫方

# 趋势
source: Trends
ja: 推移
ko: 추이
zh_hans: 趋势
zh_hant: 趨勢

# 身体
source: Body
ja: 身体
ko: 컨디션
zh_hans: 身体
zh_hant: 身體

# 输入你的答案…
source: Enter your answer…
ja: 解答を入力…
ko: 답을 입력하세요…
zh_hans: 输入你的答案…
zh_hant: 輸入你的答案…

# 过度检查型
source: Over-checking
ja: 過剰確認型
ko: 과도한 확인형
zh_hans: 过度检查型
zh_hant: 過度檢查型

# 退出本次模拟？
source: Exit this simulation?
ja: 今回の模擬試験を終了しますか？
ko: 이번 모의시험을 종료할까요?
zh_hans: 退出本次模拟？
zh_hant: 退出本次模擬？

# 退出模拟
source: Exit simulation
ja: 模擬試験を終了
ko: 모의시험 종료
zh_hans: 退出模拟
zh_hant: 退出模擬

# 选择学科
source: Choose subject
ja: 科目を選択
ko: 과목 선택
zh_hans: 选择学科
zh_hant: 選擇學科

# 选择老师风格
source: Choose teacher style
ja: 先生のスタイルを選択
ko: 선생님 스타일 선택
zh_hans: 选择老师风格
zh_hant: 選擇老師風格

# 选择题
source: Multiple choice
ja: 選択問題
ko: 객관식
zh_hans: 选择题
zh_hant: 選擇題

# 重新分析
source: Analyze again
ja: 再分析
ko: 다시 분석
zh_hans: 重新分析
zh_hant: 重新分析

# 重新开始辩论
source: Restart debate
ja: ディベートを再開
ko: 토론 다시 시작
zh_hans: 重新开始辩论
zh_hant: 重新開始辯論

# 重测
source: Re-run
ja: 再予測
ko: 재예측
zh_hans: 重测
zh_hant: 重測

# 错误
source: Error
ja: エラー
ko: 오류
zh_hans: 错误
zh_hant: 錯誤

# 错题辩论
source: Mistake Debate
ja: 間違い問題ディベート
ko: 오답 토론
zh_hans: 错题辩论
zh_hant: 錯題辯論

# 问我关于你的身体状态、成绩、趋势、复习建议的问题。 我会先判断需要哪些数据,再合并上下文给你回答。
source: Ask me about your body status, grades, trends, or review plan.\nI'll first decide which data I need, then merge it with your question.
ja: 体調・成績・推移・復習について質問してください。\n必要なデータを見極めてから、文脈と一緒に回答します。
ko: 컨디션, 성적, 추이, 복습에 대해 질문해 주세요.\n필요한 데이터를 먼저 파악한 뒤, 문맥과 함께 답합니다.
zh_hans: 问我关于你的身体状态、成绩、趋势、复习建议的问题。\n我会先判断需要哪些数据,再合并上下文给你回答。
zh_hant: 問我關於你的身體狀態、成績、趨勢、複習建議的問題。\n我會先判斷需要哪些資料,再合併上下文給你回答。

# 隐藏数据快照
source: Hide data snapshot
ja: データスナップショットを非表示
ko: 데이터 스냅샷 숨기기
zh_hans: 隐藏数据快照
zh_hant: 隱藏資料快照

# 雷达建议 · 深入探讨
source: Radar Suggestion · Discuss Further
ja: レーダー提案 · さらに議論
ko: 레이더 제안 · 심층 토론
zh_hans: 雷达建议 · 深入探讨
zh_hant: 雷達建議 · 深入探討

# 首题执着型
source: First-question fixation
ja: 第1問固執型
ko: 첫 문제 집착형
zh_hans: 首题执着型
zh_hant: 首題執著型

source: OK
ko: 확인
zh_hans: 好
zh_hant: 好

source: Todo
ko: 할 일
zh_hans: 待办
zh_hant: 待辦

# 好
source: OK
ko: 확인
zh_hans: 好
zh_hant: 好

source: %d%% (CI −%d%%)
zh_hans: %d%% (CI 缩窄 −%d%%)
zh_hant: %d%% (CI 縮窄 −%d%%)

source: BYOK
zh_hans: 自带 Key
zh_hant: 自帶金鑰

source: LLM
zh_hans: 大模型
zh_hant: 大語言模型

# time.investment.rewardIcon
source: SF Symbol
zh_hans: SF Symbol 图标
zh_hant: SF Symbol 圖示
